content/html/meeting-notes/2012-03-20.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Meeting Notes 2012-03-20</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Meeting Notes 2012-03-20"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-04-25 22:11:25 EDT"/>
<meta name="author" content="Matthew Croop"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up" style="text-align:right;font-size:70%;white-space:nowrap;">
 <a accesskey="h" href="sitemap.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Meeting Notes 2012-03-20</h1>


<script type="text/javascript">

  var _gaq = _gaq || [];
  _gaq.push(['_setAccount', 'UA-30426956-1']);
  _gaq.push(['_trackPageview']);

  (function() {
    var ga = document.createElement('script'); ga.type = 'text/javascript'; ga.async = true;
    ga.src = ('https:' == document.location.protocol ? 'https://ssl' : 'http://www') + '.google-analytics.com/ga.js';
    var s = document.getElementsByTagName('script')[0]; s.parentNode.insertBefore(ga, s);
  })();

</script>




<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Trolling</a></li>
<li><a href="#sec-2">A Hunter-Gatherer Society</a></li>
<li><a href="#sec-3">Our Project</a></li>
<li><a href="#sec-4">Potluck</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Trolling</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>First item on the agenda: Trolling.
</li>
<li><b>John</b>: Can I borrow your dongle?
<ul>
<li>He wants to show off his globe demo.
</li>
<li><b>Mish</b>: That has nothing to do with emacs!
</li>
<li><b>John</b>: It was written with emacs!
</li>
<li>It's a spinning globe, backed by real data.
<ul>
<li><b>John</b>: Real data that I generate on the fly.
</li>
</ul>

</li>
</ul>

</li>
<li><b>Andrew</b>: Look at this sticker I got! "Net neutrality, I won't waffle on."
<ul>
<li>Rafe reorganizes the words to make more sense.
</li>
</ul>

</li>
<li>A fly is trolling us.
<ul>
<li><b>Rafe</b>: Stay away from my food!
</li>
</ul>

</li>
<li><b>Mish</b>: Have we trolled enough?
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">A Hunter-Gatherer Society</h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>There is much discussion as to whether or not "Food" should be an item on
    the agenda.
</li>
<li><b>Rafe</b>: Is Koreana Korean food?
</li>
<li>Andrew is assigned to getting food, via the nose game. The nose game will
    be the process for assigning food-gathering for all future meetings. 
<ul>
<li><b>Rafe</b>: We should put that in our bylaws.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">Our Project</h2>
<div class="outline-text-2" id="text-3">

<ul>
<li><b>Mish</b>: We're going to make a package by the end of the semeseter.
</li>
<li>We discuss packages to write.
</li>
<li><b>Rafe</b>: Emacs MySpace client.
</li>
<li>Emacs Starter Kit is too bloated. Mish suggests Penn Starter Kit.
<ul>
<li><b>Rafe</b>: Is there an emacs mode for LC4?
</li>
<li>PennSim integration!
</li>
</ul>

</li>
<li><b>Mish</b>: Any other ideas?
<ul>
<li><b>John</b>: Whoa.
</li>
</ul>

</li>
</ul>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Potluck</h2>
<div class="outline-text-2" id="text-4">

<ul>
<li><b>Mish</b>: Zach asked me to host an .emacs init file potluck.
<ul>
<li>Everyone brings their .emacs files.
</li>
</ul>

</li>
<li><b>Andrew</b>: I keep getting "emacs quit unexpectedly." But I'm not running
    emacs.
</li>
<li><b>Mish</b>: Give me the dongle.
<ul>
<li>John's spinning globe is no longer projected :(
</li>
</ul>

</li>
<li><b>Mish</b>: At some point I want to figure out how to use email!
</li>
<li>Andrew doesn't organize his .emacs. He does <code>cat &gt;&gt; .emacs</code> whenever he
    wants to add anything.
</li>
</ul>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-04-25 22:11:25 EDT</p>
<p class="author">Author: Matthew Croop</p>
<p class="creator">Org version 7.8.09 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
